package by.epam.first_lesson.linear;

// Написать программу, которая выводит на экран первые четыре степени числа PI. 

public class LinearFifteen {

	public static void main(String[] args) {
		
		for (int i = 1; i <= 4; i++) {
			System.out.println(Math.pow(Math.PI, i));
		}
	}

}
